#include <iostream>
using namespace std;
/* 1. ввести числа
   2. вычислить кол-во чисел делящийся на 4 с остатком (0,1,2,3)
   3. вычислить кол-во комбинаций(001,002,003,012,011,023,033,113,111,122,123,133,222,223,233,333)
   4. вывести сумму количеств комбинаций
*/

int main() {
	int n(0);
	int c[4] = {0,0,0,0};
	int cur_num(0);
	cin >> n ;
	for(int i(0);i<n;i++)
	    {
	    	cin >> cur_num;
	    	c[cur_num%4] ++;
		}
	cout << c[0] << " "<<c[1] <<" " <<c[2] << " "<< c[3] ;
	    

	return 0;
}
